Desktop/aA-projects/W10D2/URLShortener/app/models/shortened_url.rb

SELECT  1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "qtdJAT3Pq9m6Q4Gd7Y3MhA"], ["LIMIT", 1]]
---
    def self.random_code
        new_short_url=SecureRandom.urlsafe_base64
            until !ShortenedUrl.exists?(short_url: new_short_url)

INSERT INTO "shortened_urls" ("short_url", "long_url", "submitted_user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["short_url", "qtdJAT3Pq9m6Q4Gd7Y3MhA"], ["long_url", "jasfkljfaklj"], ["submitted_user_id", 6], ["created_at", "2020-02-25 01:38:28.164418"], ["updated_at", "2020-02-25 01:38:28.164418"]]
---
    def self.create_new_shortened_url(user,long_url_input)
        ShortenedUrl.create!(
        short_url: ShortenedUrl.random_code,
        long_url: long_url_input,
        submitted_user_id: user.id
        )