Desktop/aA-projects/W10D2/URLShortener/app/models/visit.rb

INSERT INTO "visits" ("shortened_url_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["shortened_url_id", 8], ["user_id", 7], ["created_at", "2020-02-25 20:46:45.211484"], ["updated_at", "2020-02-25 20:46:45.211484"]]
---
    def self.record_visit!(user,shortened_url)
        Visit.create!(user_id: user.id,shortened_url_id: shortened_url.id)