Desktop/aA-projects/W11D3/Cats99/app/models/cat_rental_request.rb

    def does_not_overlap_approved_request
        unless overlapping_approved_requests.empty?
---
SELECT  1 AS one FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" IS NOT NULL AND "cat_rental_requests"."cat_id" = $1 AND NOT (start_date > '2020-02-24' OR end_date < '2020-02-22') AND ('APPROVED') LIMIT $2  [["cat_id", 1], ["LIMIT", 1]]