Desktop/aA-projects/W11D3/Cats99/app/views/cats/show.html.erb

SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = $1 ORDER BY start_date  [["cat_id", 1]]
---
    <tbody>
    <% @cat.cat_rental_requests.order('start_date').each do |request| %>