Desktop/aA-projects/W11D3/Cats99/app/controllers/cat_rental_requests_controller.rb

    def create
        @cat_rental_requests=CatRentalRequest.new(cat_rental_requests_params)
        if @cat_rental_requests.save!
---
INSERT INTO "cat_rental_requests" ("cat_id", "start_date", "end_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["cat_id", 1], ["start_date", "2020-02-22"], ["end_date", "2020-02-24"], ["created_at", "2020-03-12 18:10:01.102941"], ["updated_at", "2020-03-12 18:10:01.102941"]]