Desktop/aA-projects/W11D3/Cats99/app/controllers/cats_controller.rb

    def create
        @cat=Cat.new(cat_params)
        if @cat.save!
---
INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["birth_date", "2023-02-02"], ["color", "red"], ["name", "asfd"], ["sex", "f"], ["description", " asdf"], ["created_at", "2020-03-11 00:37:06.118540"], ["updated_at", "2020-03-11 00:37:06.118540"]]

    def update
        @cat=Cat.find(params[:id])
        if @cat.update_attributes(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "name" = $1, "color" = $2, "sex" = $3, "updated_at" = $4 WHERE "cats"."id" = $5  [["name", "Kitkat"], ["color", "red"], ["sex", "f"], ["updated_at", "2020-03-11 00:29:05.361850"], ["id", 1]]