my_project_name/app/controllers/users_controller.rb

    def update
        user=User.find(params[:id])
        user.update!(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "josh"], ["updated_at", "2020-03-06 01:15:12.054982"], ["id", 2]]