Desktop/aA-projects/W10D2/URLShortener/app/models/concerns/visit.rb

    def self.record_visit!(user,shortened_url)
        Visit.create!(
            user_id: user.id
            shortened_url_id: shortened_url.id
             )
---
INSERT INTO "visits" ("shortened_url_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["shortened_url_id", 4], ["user_id", 6], ["created_at", "2020-02-25 01:38:28.185475"], ["updated_at", "2020-02-25 01:38:28.185475"]]