Desktop/aA-projects/W11D2/my_project_name/app/controllers/artwork_shares_controller.rb

    def create
        artwork_share=ArtworkShare.new(artwork_shares_params)
        if artwork_share.save
---
INSERT INTO "artwork_shares" ("artwork_id", "viewer_id") VALUES ($1, $2) RETURNING "id"  [["artwork_id", 1], ["viewer_id", 9]]