Desktop/aA-projects/W11D2/my_project_name/app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks" INNER JOIN "artwork_shares" ON "artwork_shares"."artwork_id" = "artworks"."id" WHERE (artwork_shares.viewer_id='2' OR artworks.artist_id='2')
---
    def index
        user_id=params[:user_id]
        render json: Artwork.joins(:artwork_shares)
        .where("artwork_shares.viewer_id=? OR artworks.artist_id=?",user_id,user_id).distinct

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "artworks" SET "artist_id" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["artist_id", 11], ["updated_at", "2020-03-09 18:00:56.864950"], ["id", 2]]
---
    def update
        artwork=Artwork.find(params[:id])
        if artwork.update(artwork_params)