Desktop/aA-projects/W11D2/my_project_name/app/controllers/comments_controller.rb

    def index
        if params[:comment][:user_id]
            render json: Comment.where("comments.user_id=?",params[:comment][:user_id])
        elsif params[:comment][:artwork_id]
            render json: Comment.where("comments.artwork_id=?",params[:comment][:artwork_id])
        else render json: Comment.all
---
SELECT "comments".* FROM "comments" WHERE (comments.artwork_id='17')
SELECT "comments".* FROM "comments" WHERE (comments.user_id='20')

    def create
        comment=Comment.new(comment_params)
        if comment.save
---
INSERT INTO "comments" ("user_id", "artwork_id", "body") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 12], ["artwork_id", 9], ["body", "\"I changed my mind\""]]