Desktop/aA-projects/W11D2/my_project_name/app/controllers/users_controller.rb

    def index
        if params[:user][:username]
            render json: User.where("users.username LIKE ?","%#{params[:user][:username]}%")
        else render json:User.all
---
SELECT "users".* FROM "users" WHERE (users.username LIKE '%params[:query]%')