Desktop/aA-projects/W11D3/Cats99/app/views/cat_rental_requests/new.html.erb

<option disabled selected>Choose a Cat</option>
<% Cat.all.each do |cat| %>
---
SELECT "cats".* FROM "cats"